//KC03CB7Z JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//             TIME=(,5)                                        
//************************************                          
//* EJECUCION PROGRAMA PGM3CCB7      *                          
//************************************                          
//STEP1    EXEC PGM=PGM3CCB7                                    
//STEPLIB  DD DSN=KC03CB7.CURSOS.PGMLIB,DISP=SHR                
//DDCLIE   DD DSN=KC02788.ALU9999.CURSOS.CLIENTE,DISP=SHR       
//SYSOUT   DD SYSOUT=*                                          
//SYSUDUMP DD SYSOUT=*                                          
//*                                                             
//                                                              
